In [1113]:
import pandas as pd
import numpy as np

### Step 1: Import Dataset

In [1114]:
df = pd.read_csv("chipotle.tsv", sep="\t")

In [1115]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [1116]:
df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 2: Dataset Overview

In [1117]:
df.shape

(4622, 5)

In [1118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [1119]:
# print all columns name
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [1120]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [1121]:
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [1122]:
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

#### `loc`
df.loc[row_labels, column_labels]

In [1123]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [1124]:
df.loc[df["quantity"] == 15]

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25

In [1125]:
df.loc[(df["quantity"] == 15) | (df["item_name"] == "Nantucket Nectar")]

,order_id,quantity,item_name,choice_description,item_price
2,1,1,Nantucket Nectar,[Apple],$3.39
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
105,46,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
173,77,1,Nantucket Nectar,[Apple],$3.39
205,91,1,Nantucket Nectar,[Peach Orange],$3.39
436,189,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
925,381,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
1356,553,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
1585,641,1,Nantucket Nectar,[Peach Orange],$3.39
1626,656,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
1706,690,1,Nantucket Nectar,[Apple],$3.39
2162,872,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78
2381,947,1,Nantucket Nectar,[Apple],$3.39
2430,965,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
2653,1053,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
2818,1118,1,Nantucket Nectar,[Apple],$3.39
2838,1128,1,Nantucket Nectar,[Peach Orange],$3.39
2853,1133,1,Nantucket Nectar,[Apple],$3.39
2949,1172,1,Nantucket Nectar,[Peach Orange],$3.39
3318,1330,1,Nantucket Nectar,[Peach Orange],$3.39
3368,1351,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
3570,1433,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25
3845,1541,1,Nantucket Nectar,[Peach Orange],$3.39
4019,1609,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
4078,1632,1,Nantucket Nectar,[Peach Orange],$3.39

In [1126]:
df.loc[(df["quantity"] == 2) & (df["item_name"] == "Nantucket Nectar")]

,order_id,quantity,item_name,choice_description,item_price
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78

In [1127]:
df.loc[(df["quantity"] == 2) & (df["item_name"] == "Nantucket Nectar"), ["order_id", "quantity", "item_name"]]

      order_id  quantity         item_name
601        247         2  Nantucket Nectar
2379       947         2  Nantucket Nectar

#### `iloc`
df.iloc[row_positions, column_positions]

In [1128]:
print(df.iloc[9])
print(type(df.iloc[9]))

order_id                                                              5
quantity                                                              1
item_name                                                 Steak Burrito
choice_description    [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...
item_price                                                       $9.25
Name: 9, dtype: object
<class 'pandas.core.series.Series'>

In [1129]:
print(df.iloc[[9]])
print(type(df.iloc[[9]]))

   order_id  quantity      item_name  \
9         5         1  Steak Burrito

                                  choice_description item_price
9  [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...     $9.25
<class 'pandas.core.frame.DataFrame'>

In [1130]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [1131]:
X = df.iloc[3:5, :-1]
print(X)

   order_id  quantity                              item_name  \
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl

                                  choice_description
3                                                NaN
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...

In [1132]:
y = df.iloc[3:5, -1]
print(y)

3     $2.39
4    $16.98
Name: item_price, dtype: object

### Step 3: Data Manipulation

#### `Add a new column`

In [1133]:
data = {
    "Name": ["Spongebob", "Patrick", "Squidward"],
    "Age": [30, 50, 50]
}

df = pd.DataFrame(data, index=["Employee 1", "Employee 2", "Employee 3"])
df

                 Name  Age
Employee 1  Spongebob   30
Employee 2    Patrick   50
Employee 3  Squidward   50

In [1134]:
df["Job"] = ["Cook", "N/A", "Cashier"]
df

                 Name  Age      Job
Employee 1  Spongebob   30     Cook
Employee 2    Patrick   50      N/A
Employee 3  Squidward   50  Cashier

#### `Add a new row`

In [1135]:
#new_row = pd.Series({"Name": "Sandy", "Age": 28, "Job": "Engineer",}, name="Empolyee 4")
new_row = pd.DataFrame([{"Name": "Sandy", "Age": 28, "Job": "Engineer",}], index=["Employee 4"])

#df = pd.concat([df, new_row.to_frame().T])
df = pd.concat([df, new_row])

# or
#df.loc[new_row.name] = new_row
df

                 Name  Age       Job
Employee 1  Spongebob   30      Cook
Employee 2    Patrick   50       N/A
Employee 3  Squidward   50   Cashier
Employee 4      Sandy   28  Engineer

#### `Aggregate Functions`

In [1136]:
df = pd.read_csv("Pokemon.csv", index_col="No")
df.head()

          Name  Type1   Type2  Height  Weight  Legendary
No
1    Bulbasaur  Grass  Poison     0.7     6.9          0
2      Ivysaur  Grass  Poison     1.0    13.0          0
3     Venusaur  Grass  Poison     2.0   100.0          0
4   Charmander   Fire     NaN     0.6     8.5          0
5   Charmeleon   Fire     NaN     1.1    19.0          0

##### `mean()`

In [1137]:
df.mean(numeric_only=True)

Height        1.200000
Weight       46.231333
Legendary     0.026667
dtype: float64

##### `median()`

In [1138]:
df.median(numeric_only=True)

Height        1.0
Weight       30.0
Legendary     0.0
dtype: float64

##### `mode()`

In [1139]:
df.mode(numeric_only=True)

   Height  Weight  Legendary
0     1.0    30.0          0

##### `std()`

In [1140]:
df.std(numeric_only=True)

Height        0.963634
Weight       59.547388
Legendary     0.161647
dtype: float64

##### `min(), max()`

In [1141]:
df.min(numeric_only=True), df.max(numeric_only=True)

(Height       0.2
 Weight       0.1
 Legendary    0.0
 dtype: float64,
 Height         8.8
 Weight       460.0
 Legendary      1.0
 dtype: float64)

##### `sum()`

In [1142]:
df.sum(numeric_only=True)

Height        180.0
Weight       6934.7
Legendary       4.0
dtype: float64

#### `Corr()`

In [1143]:
df.corr(numeric_only=True)

             Height    Weight  Legendary
Height     1.000000  0.565657   0.107714
Weight     0.565657  1.000000   0.073262
Legendary  0.107714  0.073262   1.000000

#### `cov()`

In [1144]:
df.cov(numeric_only=True)

              Height       Weight  Legendary
Height      0.928591    32.458456   0.016779
Weight     32.458456  3545.891428   0.705199
Legendary   0.016779     0.705199   0.026130

#### `apply()`

In [1145]:
df = pd.read_csv("chipotle.tsv", sep="\t")
df["item_price"].dtype

dtype('O')

In [1146]:
df["item_price"].apply(lambda x: float(x.replace("$", "")))

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [1147]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [1148]:
df["item_price"] = df["item_price"].apply(lambda x: float(x.replace("$", "")))

In [1149]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [1150]:
df["total_price"] = df["quantity"] * df["item_price"]

In [1151]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [1152]:
"""
How much was the revenue for the period in the dataset?
"""
revenue = df["total_price"].sum()
print(revenue)

39237.02

#### `Group by`

In [1153]:
"""
Which was the most-ordered item?
"""
c = df.groupby(["item_name"])["quantity"].sum()

In [1154]:
c.sort_values(ascending=False)

item_name
Chicken Bowl                             761
Chicken Burrito                          591
Chips and Guacamole                      506
Steak Burrito                            386
Canned Soft Drink                        351
Chips                                    230
Steak Bowl                               221
Bottled Water                            211
Chips and Fresh Tomato Salsa             130
Canned Soda                              126
Chicken Salad Bowl                       123
Chicken Soft Tacos                       120
Side of Chips                            110
Veggie Burrito                            97
Barbacoa Burrito                          91
Veggie Bowl                               87
Carnitas Bowl                             71
Barbacoa Bowl                             66
Carnitas Burrito                          60
Steak Soft Tacos                          56
6 Pack Soft Drink                         55
Chicken Crispy Tacos                      50
Chips and Tomatillo Red Chili Salsa       50
Chips and Tomatillo Green Chili Salsa     45
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        36
Chips and Tomatillo-Green Chili Salsa     33
Steak Salad Bowl                          31
Nantucket Nectar                          29
Chips and Tomatillo-Red Chili Salsa       25
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        23
Izze                                      20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     12
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Carnitas Crispy Tacos                      8
Veggie Soft Tacos                          8
Burrito                                    6
Carnitas Salad Bowl                        6
Veggie Salad                               6
Bowl                                       4
Steak Salad                                4
Salad                                      2
Crispy Tacos                               2
Carnitas Salad                             1
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Name: quantity, dtype: int64

In [1155]:
# Unique Value
df["item_name"].value_counts()

item_name
Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Chips                                    211
Steak Bowl                               211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Burrito                                    6
Carnitas Salad Bowl                        6
Veggie Salad                               6
Steak Salad                                4
Crispy Tacos                               2
Bowl                                       2
Salad                                      2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: count, dtype: int64

In [1156]:
df["item_name"].value_counts().count()

np.int64(50)

In [1157]:
df["item_name"].nunique()

50

In [1178]:
data = {
    "Department": ["IT", "IT", "HR", "HR", "Finance", "Finance"],
    "Employee": ["Alice", "Bob", "Alice", "Bob", "Alice", "Bob"],
    "Salary": [6000, 6500, 5500, 5700, 7000, 7200],
    "Bonus": [500, 600, 400, 420, 800, 850],
}

df = pd.DataFrame(data)

result = df.groupby(["Department", "Employee"])[["Salary", "Bonus"]].mean()
print(result)

                     Salary  Bonus
Department Employee
Finance    Alice     7000.0  800.0
           Bob       7200.0  850.0
HR         Alice     5500.0  400.0
           Bob       5700.0  420.0
IT         Alice     6000.0  500.0
           Bob       6500.0  600.0

#### `Cleaning Empty Cells`

##### `dropna()`

In [1158]:
df = pd.read_csv("chipotle.tsv", sep="\t")

new_df = df.dropna()
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3376 entries, 1 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            3376 non-null   int64
 1   quantity            3376 non-null   int64
 2   item_name           3376 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          3376 non-null   object
dtypes: int64(2), object(3)
memory usage: 158.2+ KB

In [1159]:
"""
By default, the dropna() method returns a new DataFrame, and will not change the original.
If you want to change the original DataFrame, use the inplace = True argument.
"""
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3376 entries, 1 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            3376 non-null   int64
 1   quantity            3376 non-null   int64
 2   item_name           3376 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          3376 non-null   object
dtypes: int64(2), object(3)
memory usage: 158.2+ KB

##### `fillna()`

In [1160]:
df = pd.read_csv("chipotle.tsv", sep="\t")

df.fillna("Unknow", inplace=True)
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,Unknow,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,Unknow,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [1161]:
df = pd.read_csv("chipotle.tsv", sep="\t")
df.fillna({"choice_description" : "Unknow"}, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  4622 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

#### `Finding missing element`
##### `isnull()`

In [1162]:
"""
False: not missing
"""
df = pd.read_csv("chipotle.tsv", sep="\t")
df.isnull()

      order_id  quantity  item_name  choice_description  item_price
0        False     False      False                True       False
1        False     False      False               False       False
2        False     False      False               False       False
3        False     False      False                True       False
4        False     False      False               False       False
...        ...       ...        ...                 ...         ...
4617     False     False      False               False       False
4618     False     False      False               False       False
4619     False     False      False               False       False
4620     False     False      False               False       False
4621     False     False      False               False       False

[4622 rows x 5 columns]

##### `isna()`

In [1163]:
"""
False: not missing
"""
df = pd.read_csv("chipotle.tsv", sep="\t")
df.isna()

      order_id  quantity  item_name  choice_description  item_price
0        False     False      False                True       False
1        False     False      False               False       False
2        False     False      False               False       False
3        False     False      False                True       False
4        False     False      False               False       False
...        ...       ...        ...                 ...         ...
4617     False     False      False               False       False
4618     False     False      False               False       False
4619     False     False      False               False       False
4620     False     False      False               False       False
4621     False     False      False               False       False

[4622 rows x 5 columns]

In [1164]:
df.isna().any()

order_id              False
quantity              False
item_name             False
choice_description     True
item_price            False
dtype: bool

In [1165]:
df.isna().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

#### `Duplicated Values`
##### `duplicated()`

In [1166]:
"""
False: not duplicated
"""
df = pd.read_csv("chipotle.tsv", sep="\t")
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Length: 4622, dtype: bool

In [1167]:
df.duplicated(subset=["choice_description"])

0       False
1       False
2       False
3        True
4       False
        ...
4617     True
4618     True
4619     True
4620     True
4621     True
Length: 4622, dtype: bool

#### `drop_duplicated()`

In [1168]:
df = pd.read_csv("chipotle.tsv", sep="\t")

In [1169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [1170]:
df.drop_duplicates(inplace=True)

In [1171]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4563 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4563 non-null   int64
 1   quantity            4563 non-null   int64
 2   item_name           4563 non-null   object
 3   choice_description  3335 non-null   object
 4   item_price          4563 non-null   object
dtypes: int64(2), object(3)
memory usage: 213.9+ KB

#### `Deleting columns`

In [1172]:
df = pd.read_csv("chipotle.tsv", sep="\t")
print(df.shape)
df.drop(["choice_description"], axis=1, inplace=True)
print(df.shape)

(4622, 5)
(4622, 4)

#### `Finding the unique values in a column`

In [1173]:
df = pd.read_csv("chipotle.tsv", sep="\t")
df["choice_description"].unique()

array([nan, '[Clementine]', '[Apple]', ...,
       '[Roasted Chili Corn Salsa, [Pinto Beans, Sour Cream, Cheese, Lettuce, Guacamole]]',
       '[Tomatillo Green Chili Salsa, [Rice, Black Beans]]',
       '[Tomatillo Green Chili Salsa, [Rice, Fajita Vegetables, Black Beans, Guacamole]]'],
      dtype=object)

#### `Counting number of values in column`

In [1174]:
df = pd.read_csv("chipotle.tsv", sep="\t")
df["quantity"].value_counts()

quantity
1     4355
2      224
3       28
4       10
5        1
15       1
7        1
8        1
10       1
Name: count, dtype: int64